---
kind: property
id: P:Autodesk.Revit.DB.UnitTypeId.NewtonMetersPerMeter
source: html/4d0b2e35-4425-fedd-eddb-08ac855ee0c1.htm
---
# Autodesk.Revit.DB.UnitTypeId.NewtonMetersPerMeter Property

Newton meters per meter.

## Syntax (C#)
```csharp
public static ForgeTypeId NewtonMetersPerMeter { get; }
```